# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

str1 = input("Введите первую строку: ")
str2 = input("Введите вторую строку: ")
print(str1.count(str2))
